@zbindenren 

I tried below monitor config, and destination port is set in bigip and also in the state file

resource "bigip_ltm_monitor" "monitor" {
  name       = "/Common/terraform_monitor1"
  parent     = "/Common/http"
  send       = "GET /some/path123\r\n"
  timeout    = "100"
  interval   = "30"
  destination = "*:7003"
}


Terraform will perform the following actions:

  # bigip_ltm_monitor.monitor will be created
  + resource "bigip_ltm_monitor" "monitor" {
      + adaptive       = (known after apply)
      + adaptive_limit = (known after apply)
      + compatibility  = (known after apply)
      + destination    = "*:7003"
      + id             = (known after apply)
      + interval       = 30
      + ip_dscp        = (known after apply)
      + manual_resume  = (known after apply)
      + mode           = (known after apply)
      + name           = "/Common/terraform_monitor1"
      + parent         = "/Common/http"
      + reverse        = (known after apply)
      + send           = "GET /some/path123\\r\\n"
      + time_until_up  = (known after apply)
      + timeout        = 100
      + transparent    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

![image](https://user-images.githubusercontent.com/48274565/92387322-ed4b1100-f132-11ea-80f8-d8c08f579d3d.png)



# Terraform State file


{
  "version": 4,
  "terraform_version": "0.12.25",
  "serial": 29,
  "lineage": "b1aa906f-4f3c-5b48-25d6-ca105a518e06",
  "outputs": {},
  "resources": [
    {
      "mode": "managed",
      "type": "bigip_ltm_monitor",
      "name": "monitor",
      "provider": "provider.bigip",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "adaptive": "disabled",
            "adaptive_limit": 200,
            "compatibility": "",
            "database": "",
            "defaults_from": "",
            "destination": "*:7003",
            "filename": "",
            "id": "/Common/terraform_monitor1",



I am using bigip provider version : 1.3.2 and bigip version 14.x , what is the bigip version you are using ?



